In [1]:
import numpy as np

In [26]:
import pandas as pd
import matplotlib.pyplot as plt

In [3]:
df=[1,2]

In [4]:
df

[1, 2]

In [5]:
thislist = ["apple", "banana", "cherry", "orange", "kiwi", "melon", "mango"]
print(thislist[2:5])

['cherry', 'orange', 'kiwi']

In [6]:
pwd

'/Users/buqingyin'

In [15]:
dataset=pd.read_csv('Data.csv')

In [16]:
dataset.info

<bound method DataFrame.info of    Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
4  Germany  40.0      NaN       Yes
5   France  35.0  58000.0       Yes
6    Spain   NaN  52000.0        No
7   France  48.0  79000.0       Yes
8  Germany  50.0  83000.0        No
9   France  37.0  67000.0       Yes>

In [20]:
x=dataset.iloc[:,:-1].values
x

array([['France', 44.0, 72000.0],
       ['Spain', 27.0, 48000.0],
       ['Germany', 30.0, 54000.0],
       ['Spain', 38.0, 61000.0],
       ['Germany', 40.0, nan],
       ['France', 35.0, 58000.0],
       ['Spain', nan, 52000.0],
       ['France', 48.0, 79000.0],
       ['Germany', 50.0, 83000.0],
       ['France', 37.0, 67000.0]], dtype=object)

In [21]:
y=dataset.iloc[:,-1].values
y

array(['No', 'Yes', 'No', 'No', 'Yes', 'Yes', 'No', 'Yes', 'No', 'Yes'],
      dtype=object)

In [32]:
from pandasql import sqldf

In [31]:
from pandasql import load_births

In [35]:
births=load_births()
print(sqldf("select * from births where births >250000 limit 5;",locals()))

                         date  births
0  1975-01-01 00:00:00.000000  265775
1  1975-03-01 00:00:00.000000  268849
2  1975-05-01 00:00:00.000000  254545
3  1975-06-01 00:00:00.000000  254096
4  1975-07-01 00:00:00.000000  275163

In [38]:
q="""
select date(date) as DOB,sum(births) as "total births"
from births
group by date
limit 10;
"""
print(sqldf(q,locals()))

          DOB  total births
0  1975-01-01        265775
1  1975-02-01        241045
2  1975-03-01        268849
3  1975-04-01        247455
4  1975-05-01        254545
5  1975-06-01        254096
6  1975-07-01        275163
7  1975-08-01        281300
8  1975-09-01        270738
9  1975-10-01        265494

In [39]:
print(sqldf(q,globals()))

          DOB  total births
0  1975-01-01        265775
1  1975-02-01        241045
2  1975-03-01        268849
3  1975-04-01        247455
4  1975-05-01        254545
5  1975-06-01        254096
6  1975-07-01        275163
7  1975-08-01        281300
8  1975-09-01        270738
9  1975-10-01        265494

In [47]:
dfinternetsales=pd.read_csv('FactInternetSales.csv')
dfinternetsales.dtypes

ProductKey                 int64
OrderDateKey               int64
DueDateKey                 int64
ShipDateKey                int64
CustomerKey                int64
PromotionKey               int64
CurrencyKey                int64
SalesTerritoryKey          int64
SalesOrderNumber          object
SalesOrderLineNumber       int64
RevisionNumber             int64
OrderQuantity              int64
UnitPrice                float64
ExtendedAmount           float64
UnitPriceDiscountPct       int64
DiscountAmount             int64
ProductStandardCost      float64
TotalProductCost         float64
SalesAmount              float64
TaxAmt                   float64
Freight                  float64
CarrierTrackingNumber    float64
CustomerPONumber         float64
OrderDate                 object
DueDate                   object
ShipDate                  object
dtype: object

In [49]:
dfcustomer=pd.read_csv('DimCustomer.csv')

In [50]:
dfcustomer.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 18484 entries, 0 to 18483
Data columns (total 29 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   CustomerKey           18484 non-null  int64
 1   GeographyKey          18484 non-null  int64
 2   CustomerAlternateKey  18484 non-null  object
 3   Title                 101 non-null    object
 4   FirstName             18484 non-null  object
 5   MiddleName            10654 non-null  object
 6   LastName              18484 non-null  object
 7   NameStyle             18484 non-null  int64
 8   BirthDate             18484 non-null  object
 9   MaritalStatus         18484 non-null  object
 10  Suffix                3 non-null      object
 11  Gender                18484 non-null  object
 12  EmailAddress          18484 non-null  object
 13  YearlyIncome          18484 non-null  float64
 14  TotalChildren         18484 non-null  int64
 15  NumberChildrenAtHome  18484 non-null  int64
 16  EnglishEducation      18484 non-null  object
 17  SpanishEducation      18484 non-null  object
 18  FrenchEducation       18484 non-null  object
 19  EnglishOccupation     18484 non-null  object
 20  SpanishOccupation     18484 non-null  object
 21  FrenchOccupation      18484 non-null  object
 22  HouseOwnerFlag        18484 non-null  int64
 23  NumberCarsOwned       18484 non-null  int64
 24  AddressLine1          18484 non-null  object
 25  AddressLine2          312 non-null    object
 26  Phone                 18484 non-null  object
 27  DateFirstPurchase     18484 non-null  object
 28  CommuteDistance       18484 non-null  object
dtypes: float64(1), int64(7), object(21)
memory usage: 4.1+ MB

In [48]:
dfinternetsales.head(3)

,ProductKey,OrderDateKey,DueDateKey,ShipDateKey,CustomerKey,PromotionKey,CurrencyKey,SalesTerritoryKey,SalesOrderNumber,SalesOrderLineNumber,...,ProductStandardCost,TotalProductCost,SalesAmount,TaxAmt,Freight,CarrierTrackingNumber,CustomerPONumber,OrderDate,DueDate,ShipDate
0,310,20101229,20110110,20110105,21768,1,19,6,SO43697,1,...,2171.2942,2171.2942,3578.27,286.2616,89.4568,NaN,NaN,2010-12-29 00:00:00.000,2011-01-10 00:00:00.000,2011-01-05 00:00:00.000
1,346,20101229,20110110,20110105,28389,1,39,7,SO43698,1,...,1912.1544,1912.1544,3399.99,271.9992,84.9998,NaN,NaN,2010-12-29 00:00:00.000,2011-01-10 00:00:00.000,2011-01-05 00:00:00.000
2,346,20101229,20110110,20110105,25863,1,100,1,SO43699,1,...,1912.1544,1912.1544,3399.99,271.9992,84.9998,NaN,NaN,2010-12-29 00:00:00.000,2011-01-10 00:00:00.000,2011-01-05 00:00:00.000

In [55]:

from pandasql import sqldf
print(sqldf('''select FirstName,LastName,EnglishOccupation as "JobTitle" from dfcustomer order by LastName,FirstName limit 5'''))

   FirstName LastName        JobTitle
0      Aaron    Adams  Skilled Manual
1       Adam    Adams      Management
2       Alex    Adams  Skilled Manual
3  Alexandra    Adams    Professional
4    Allison    Adams        Clerical

In [69]:
query='''select * 
           from dfcustomer                     c
           left  join dfinternetsales     s
                on (c.CustomerKey = s.CustomerKey) limit 3'''
sqldf(query)

,CustomerKey,GeographyKey,CustomerAlternateKey,Title,FirstName,MiddleName,LastName,NameStyle,BirthDate,MaritalStatus,...,ProductStandardCost,TotalProductCost,SalesAmount,TaxAmt,Freight,CarrierTrackingNumber,CustomerPONumber,OrderDate,DueDate,ShipDate
0,11000,26,AW00011000,None,Jon,V,Yang,0,1971-10-06,M,...,13.0863,13.0863,34.99,2.7992,0.8748,None,None,2013-05-03 00:00:00.000,2013-05-15 00:00:00.000,2013-05-10 00:00:00.000
1,11000,26,AW00011000,None,Jon,V,Yang,0,1971-10-06,M,...,1912.1544,1912.1544,3399.99,271.9992,84.9998,None,None,2011-01-19 00:00:00.000,2011-01-31 00:00:00.000,2011-01-26 00:00:00.000
2,11000,26,AW00011000,None,Jon,V,Yang,0,1971-10-06,M,...,1265.6195,1265.6195,2319.99,185.5992,57.9998,None,None,2013-01-18 00:00:00.000,2013-01-30 00:00:00.000,2013-01-25 00:00:00.000

In [70]:
from pandas import DataFrame
d = {'FirstName':['A','B','C','D'],'LastName':['F','G','H','J'],'CreditAccountId':[10,11,13,15],
'DateReported':[1052020,6032020,3062020,11202020],
'TransactionAmount':[111,222,333,555]}

df = DataFrame(d,columns=['FirstName', 'LastName',
'CreditAccountId','DateReported','TransactionAmount'])
print(df)

  FirstName LastName  CreditAccountId  DateReported  TransactionAmount
0         A        F               10       1052020                111
1         B        G               11       6032020                222
2         C        H               13       3062020                333
3         D        J               15      11202020                555

In [71]:
print(df['LastName'])

0    F
1    G
2    H
3    J
Name: LastName, dtype: object

In [73]:
print(df.iloc[0,0])

A

In [75]:
print(df[(df["CreditAccountId"]>12)&(df['TransactionAmount']>200)])

  FirstName LastName  CreditAccountId  DateReported  TransactionAmount
2         C        H               13       3062020                333
3         D        J               15      11202020                555

In [76]:
df['Name']=df['LastName']+df['FirstName']

In [77]:
print(df)

  FirstName LastName  CreditAccountId  DateReported  TransactionAmount Name
0         A        F               10       1052020                111   FA
1         B        G               11       6032020                222   GB
2         C        H               13       3062020                333   HC
3         D        J               15      11202020                555   JD

In [79]:
df1 = pd.DataFrame({'FirstName':['A','A'],'LastName':['F','F'],'TransactionAmount':[111,222]},index=[0,1])
df2 = pd.DataFrame({'FirstName':['C','C',],'LastName':['G','G'],'TransactionAmount':[333,555]},index=[2,3])
df3 = pd.DataFrame({'FirstName':['D','D'],'LastName':['E','E'],'TransactionAmount':[222,888]},index=[4,5])
print(df1)

  FirstName LastName  TransactionAmount
0         A        F                111
1         A        F                222

In [80]:
print(df2)

  FirstName LastName  TransactionAmount
2         C        G                333
3         C        G                555

In [81]:
print(df3)

  FirstName LastName  TransactionAmount
4         D        E                222
5         D        E                888

In [85]:
print(pd.concat([df1,df2,df3],axis=0))

  FirstName LastName  TransactionAmount
0         A        F                111
1         A        F                222
2         C        G                333
3         C        G                555
4         D        E                222
5         D        E                888

In [86]:
print(pd.concat([df1,df2,df3],axis=1))

  FirstName LastName  TransactionAmount FirstName LastName  TransactionAmount  \
0         A        F              111.0       NaN      NaN                NaN
1         A        F              222.0       NaN      NaN                NaN
2       NaN      NaN                NaN         C        G              333.0
3       NaN      NaN                NaN         C        G              555.0
4       NaN      NaN                NaN       NaN      NaN                NaN
5       NaN      NaN                NaN       NaN      NaN                NaN

  FirstName LastName  TransactionAmount
0       NaN      NaN                NaN
1       NaN      NaN                NaN
2       NaN      NaN                NaN
3       NaN      NaN                NaN
4         D        E              222.0
5         D        E              888.0

In [87]:
df1 = pd.DataFrame({'Key':['k1','k2'],'FirstName':['A','B']})
df2 = pd.DataFrame({'Key':['k1','k2'],'LastName':['G','L']})

print(df1)
print(df2)

  Key FirstName
0  k1         A
1  k2         B
  Key LastName
0  k1        G
1  k2        L

In [88]:
print(pd.merge(df1,df2,how='inner',on='Key'))

  Key FirstName LastName
0  k1         A        G
1  k2         B        L

In [89]:
print(pd.merge(df1,df2,how='outer',on='Key'))

  Key FirstName LastName
0  k1         A        G
1  k2         B        L

In [90]:
print(pd.merge(df1,df2,how='right',on='Key'))

  Key FirstName LastName
0  k1         A        G
1  k2         B        L

In [91]:
print(pd.merge(df1,df2,how='left',on='Key'))

  Key FirstName LastName
0  k1         A        G
1  k2         B        L

In [94]:
df3 = pd.DataFrame({'TransactionAmount':[222,555,888]},index=['k1','k2','k3'])
df4 = pd.DataFrame({'FraudAmount':[51,36,25]},index=['k1','k2','k4'])
print(df3)
print(df4)

    TransactionAmount
k1                222
k2                555
k3                888
    FraudAmount
k1           51
k2           36
k4           25

In [93]:
print(df3.join(df4, how = 'outer'))

    TransactionAmount  FraudAmount
k1              222.0         51.0
k2              555.0         36.0
k3              888.0          NaN
k4                NaN         25.0

In [95]:
print(df3.join(df4))

    TransactionAmount  FraudAmount
k1                222         51.0
k2                555         36.0
k3                888          NaN

In [96]:
d = {'FirstName':['A','A','C','C','D','D','D'],'LastName':['F','F','G','G','E','E','E'],
'TransactionAmount':[111,222,333,555,222,333,888]}

df = DataFrame(d,columns=['FirstName', 'LastName',
'TransactionAmount'])
print(df)

  FirstName LastName  TransactionAmount
0         A        F                111
1         A        F                222
2         C        G                333
3         C        G                555
4         D        E                222
5         D        E                333
6         D        E                888

In [97]:
print(df.groupby('FirstName').mean())

           TransactionAmount
FirstName
A                      166.5
C                      444.0
D                      481.0

In [98]:
print(df.groupby('FirstName').sum())

           TransactionAmount
FirstName
A                        333
C                        888
D                       1443

In [99]:
print(df.groupby('FirstName').std())

           TransactionAmount
FirstName
A                  78.488853
C                 156.977705
D                 356.815078

In [100]:
#max#min
print(df.groupby('FirstName').describe())

          TransactionAmount                                                   \
                      count   mean         std    min     25%    50%     75%
FirstName
A                       2.0  166.5   78.488853  111.0  138.75  166.5  194.25
C                       2.0  444.0  156.977705  333.0  388.50  444.0  499.50
D                       3.0  481.0  356.815078  222.0  277.50  333.0  610.50


             max
FirstName
A          222.0
C          555.0
D          888.0

In [101]:
print(df.groupby('FirstName').describe().transpose())

FirstName                         A           C           D
TransactionAmount count    2.000000    2.000000    3.000000
                  mean   166.500000  444.000000  481.000000
                  std     78.488853  156.977705  356.815078
                  min    111.000000  333.000000  222.000000
                  25%    138.750000  388.500000  277.500000
                  50%    166.500000  444.000000  333.000000
                  75%    194.250000  499.500000  610.500000
                  max    222.000000  555.000000  888.000000

In [102]:

print(df.groupby('FirstName').sum().loc['A'])

TransactionAmount    333
Name: A, dtype: int64

In [103]:
def myFunc(e):
  return e['year']

cars = [
  {'car': 'Ford', 'year': 2005},
  {'car': 'Mitsubishi', 'year': 2000},
  {'car': 'BMW', 'year': 2019},
  {'car': 'VW', 'year': 2011}
]

cars.sort(key=myFunc)

In [104]:
print(cars)

[{'car': 'Mitsubishi', 'year': 2000}, {'car': 'Ford', 'year': 2005}, {'car': 'VW', 'year': 2011}, {'car': 'BMW', 'year': 2019}]